[
  {
    "tit": "How do i make and eat matzabrie?",
    "mes": "Can i get the recipe for matzabrie? It sure looked good cooking up in the pan with the butter . YUM! My dad and his mother my grandmother made home made matza ball soup. This and marrow bone soup. So delicious. So nutritious. And best of all......<br />Made with love. I miss them. I have the hope i will see them again one day.",
    "nam": "Jeanie B.",
    "loc": "Portland, Oregon",
    "email": "jmbruder@yahoo.com",
    "stamp": "2012-04-15 00:29:04"
  },
  {
    "tit": "I can&#039;t wait to get the cookbook!",
    "mes": "I just finished watching your video with my family. I do most of the cooking in our house and cannot wait to add your cookbook to my collection of Jewish cookbooks. I use all of them year-round. I did&#039;t even try to count the number of times my wife said &quot;that is my Grandmother&quot; or &quot;God, the memories this brings back&quot; (through tearsof course). I plan to use your recipes next year (2011). What a surprise it will be for my wife. I am very excited about this! I will let you know in a year how it turned out. God bless you all, and thanks for sharing!",
    "nam": "Clark K.",
    "loc": "Drexel Hill, PA",
    "email": "oldbaldy125@comcast.net",
    "stamp": "2012-04-15 00:28:46"
  },
  {
    "tit": "I love my copy of The Gefilte Fish Chronicles cookbook!",
    "mes": "As I had previously mentioned, I was going to try the cholent recipe; I did and it was so delicious!  It&#039;s hard to make a cholent for just the 2 of us, but I have made it a couple of times now and have saved and frozen some for the nights when I just don&#039;t feel like cooking.  The only thing your marvelous cookbook did not address was how difficult it is to sleep when that beautiful cooking perfumes your whole house and keeps you awake in anticipation of a most wonderful meal to come!  I love the book and the stories in it.  Mazel Tov to you and all of your family!",
    "nam": "Elizabeth",
    "loc": "in NJ",
    "email": "",
    "stamp": "2012-04-15 00:28:36"
  },
  {
    "tit": "Adam Kadmon",
    "mes": "Hi, Although I am from a Jewish Family of 4 brothers and 3 sisters, we were never close. And not nearly as close as the  beautiful Dubrofs. I have been married for 44 years this fall and, to a non Jew. But I enjoy and imagine they are my own relatives, and partake in the meal, joy and fesivities, they share with all the world. I hope they understand what they have meant to me and my family. I have seen their love poem each year, many times, and expect to for many more. Thank you, and PBS, for enriching our lives. ak",
    "nam": "Adam kadmon",
    "loc": "Yorktown Heights, NY",
    "email": "",
    "stamp": "2012-04-15 00:28:29"
  },
  {
    "tit": "happy pesach",
    "mes": "thinking of you as i schmear horseradish on my gelfite fish - and my mom and my bubbi....",
    "nam": "jayne",
    "loc": "new jersey",
    "email": "",
    "stamp": "2012-04-15 00:28:22"
  },
  {
    "tit": "BEST FAMILY MOVIE EVER",
    "mes": "LAST YEAR (2011) I WATCHED THE GEFILTE FISH CHRONICLES. I KNOW THIS IS A BLESSING FOR ME.  THIS YEAR I HAVE STARTED SHARING IT WITH PEOPLE I LOVE. WHILE READING THE WEBSITE PAGE I CRIED THROUGH THE WHOLE WRITING.  I HAVE BEEN TOUCHED BY ALL OF THE LOVE.  EVEN THOUGH THANK YOU IS NOT ENOUGH, FROM MY HEART THANK YOU.",
    "nam": "R. PAULA MURRAY",
    "loc": "WASHINGTON, DC",
    "email": "giveroflight1@msn.com",
    "stamp": "2012-04-15 00:28:14"
  },
  {
    "tit": "Thank you!",
    "mes": "We enjoyed this show very much!",
    "nam": "Richard Gindes",
    "loc": "Metro Boston",
    "email": "rgindes@aol.com",
    "stamp": "2012-04-15 00:28:06"
  },
  {
    "tit": "Blessings..........",
    "mes": "For a Happy Passover 2011 to the entire Dubroff family.  Joy and happiness this season...and all the seasons to follow!",
    "nam": "Joan",
    "loc": "Ohio",
    "email": "",
    "stamp": "2012-04-15 00:15:04"
  },
  {
    "tit": "Thank You",
    "mes": "It must be wonderful to have a family like that. I&#039;m the primary caregiver for my 85 year old Mother and my family doesn&#039;t want to take up time with her.  We watched your program and it made us feel good and not so alone.  Thank you again for being on TV.",
    "nam": "Daniel",
    "loc": "Florida",
    "email": "",
    "stamp": "2012-04-14 16:09:04"
  },
  {
    "tit": "thank you!",
    "mes": "this was one of the most wonderful shows i&#039;ve experienced.  i love those mavens as if they were my own.",
    "nam": "judy herrmann",
    "loc": "richmond california",
    "email": "happywolf@yahoo.com",
    "stamp": "2012-04-14 15:32:30"
  },
  {
    "tit": "Here&#039;s to Brooklyn",
    "mes": "4/11 Just saw the Show in KQED here in SF.<br/>Even though I&#039;m Chinese! I was raised in a Jewish neighborhood in Brooklyn!<br/>Loved the video.",
    "nam": "Susan Lee",
    "loc": "San Francisco",
    "email": "",
    "stamp": "2012-04-14 15:32:21"
  },
  {
    "tit": "Thanks for the Memories!",
    "mes": "I turned on PBS while sipping a cup of tea and thought, &quot;it is meant to be that this documentary is on now&quot;.  I continued watching with the mug of tea in one hand and a wad of tissues wiping the tears in the other.  <br/>Passover was always my favorite holiday.  I still have my mother&#039;s set of green fire king glass dishes that we used for the eight days.  I remember the Sedars at my Bubbie and Zadie&#039;s apartment in Brooklyn with my aunt&#039;s, uncles and cousins on my father&#039;s side. I loved chanting the four questions and had that honor until my younger brother took over.  At this time of year, I feel the loss of my parents and my grandparents very strongly.<br/>My sister has continued the tradition of the Sedar throughout the years. I have new insight and humor into the moments of family negativity and bickering that was(and sometimes still is) such a constant. I guess that is part of the tradition too!<br/><br/>Thank you for a wonderful program which brought back sweet memories and made me realize that the present will one day also be a lovely memory for me.<br/>I am so proud to be Jewish!   <br/><br/>A Zissen Pesach to all!",
    "nam": "Janet",
    "loc": "North Salem, NY",
    "email": "",
    "stamp": "2012-04-14 15:32:12"
  },
  {
    "tit": "I LOVE YOU --",
    "mes": "World-class Aunties!!! We should all be lucky enough, and I was, even though, I&#039;m not Jewish.",
    "nam": "Taff",
    "loc": "Sensenderfer",
    "email": "MerlenTafferSensenderfer@yahoo.com",
    "stamp": "2012-04-14 15:32:05"
  },
  {
    "tit": "&quot;Zissen Pesach&quot;",
    "mes": "4/17/2011 I was watching the Phillies and I wanted to see what else was on so I flipped to PBS and saw GFC. I didn&#039;t see much more of the game. (we won) I grew up in a very traditional Jewish home in Philadelphia. Your Family and traditions felt very familiar to me. My Grandparents in Toronto have passed (we would pile in the old s/w and drive north for our Seders as a kid) my Dad has passed and my Mom will be 90 in Two weeks. I know how hard it can be to keep the old ways going. I&#039;m so glad to see all of you, young and old keep&#039;n keep&#039;n on. G-d bless You, Your Family, and to all my well wishes of good health, happiness, and a ZISSEN PESACH!!!  PS. Best memories,the continuation of the old ways. Worst, the long rides (family of 5 boys) and the time I hid the Afiqoman under the leg of a bed,(bad idea) no rewards that year!!!",
    "nam": "Steven Sacks",
    "loc": "Phila. (Wynnewood) Pa.",
    "email": "stee282@yahoo.com",
    "stamp": "2012-04-14 15:31:37"
  },
  {
    "tit": "OH THE LOVE OF FAMILY....this is so special to me..thank you..i grew up with this SAME FAMILY...full of characters..full of LOVE!",
    "mes": "when will this show on PBS in Houston...or asheville NC..i can&#039;t wait to see this!",
    "nam": "char scharf",
    "loc": "asheville, nc and washington dc",
    "email": "charscharf@yahoo.com",
    "stamp": "2012-04-14 07:23:18"
  },
  {
    "tit": "What a joy of a movie, now I gotta get the cookbook.",
    "mes": "I was flipping through TV last night, and was captivated by this show. When I went to college I lived with a Jewish roomate who took me to her Seder meal year, and the warmth, love and true meaning of family came all back to me. I laughed and cried through the entire thing. It is so important to continue our traditions and family values in this day and age. Thank you for all the time you took to make this!!!",
    "nam": "Carol Bell",
    "loc": "Richmond Va",
    "email": "cbell7153@hotmail.com",
    "stamp": "2012-04-14 00:13:28"
  },
  {
    "tit": "My Deepest Sympathy~~~~",
    "mes": "I was about to sit down and watch TGC for yet another time, when I thought I&#039;d check the website and see what&#039;s going on with Peppy....now, I know.  How sad for all of you that this great lady is gone from your midst, but how happy she must be with her sisters, her brother and most importantly, her beloved Mama and Papa.  I had to stop crying to read the rest of your wonderful dialog of how you preceive them all chatting after Peppy&#039;s arrival.  And how much more I&#039;ll treasure my copy of TGC!  Thank you all and the blessings of the Creator.",
    "nam": "Joan Korber ",
    "loc": " Ohio ",
    "email": "beetiesmom@hotmail.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Dear Iris and David,",
    "mes": "I am so sorry to read that Peppy passed away, as I was to read last year when Rose died.\nI watch the DVD so often, when I need a laugh, a little “pick-me-up” or just for no reason at all.  Those three lovely ladies just made my day!\n\nAs a Jew by Choice, I never had the opportunity to witness or be a part of this major family undertaking: the laughing, joking, disagreements, horseradish that could put me under the table, etc.  I use your family’s experience, via the DVD, to transport myself to Peppy’s kitchen--the aerobic exercise of lifting the cholent, adding salt (too much, by one sister’s assessment) to the fish, the schmaltz to the radish………I thank you for that experience.\n\nMay all of their memories be a blessing to you..they are to me and I never had the honor of meeting them!\n\nTake good care.",
    "nam": "Chris Brand",
    "loc": " Minneapolis, MN ",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "MAZEL TOV!",
    "mes": "We were captivated!  A loving  tribute to your special family.  Loving Jewish families everywhere will want to watch this poignant, hilarious and phenomenal  celebration.  Heartfelt thanks for rekindling our own family memories.",
    "nam": "Hopie Goldsmith ",
    "loc": " Lexington, MA ",
    "email": "hoepgoldsmith4@yahoo.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "OY Vayzmere...what a joy!!!",
    "mes": "This is one of the most delightful shows I have ever seen. Every bit of it!!\n\nCan I come for Pesach next year?",
    "nam": "Lisa ",
    "loc": " Miami ",
    "email": "miamizz@aol.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Thanks for the Memories!",
    "mes": "I turned on PBS while sipping a cup of tea and thought, &quot;it is meant to be that this documentary is on now&quot;.  I continued watching with the mug of tea in one hand and a wad of tissues wiping the tears in the other.  \nPassover was always my favorite holiday.  I still have my mother&#039;s set of green fire king glass dishes that we used for the eight days.  I remember the Sedars at my Bubbie and Zadie&#039;s apartment in Brooklyn with my aunt&#039;s, uncles and cousins on my father&#039;s side. I loved chanting the four questions and had that honor until my younger brother took over.  At this time of year, I feel the loss of my parents and my grandparents very strongly.\nMy sister has continued the tradition of the Sedar throughout the years. I have new insight and humor into the moments of family negativity and bickering that was(and sometimes still is) such a constant. I guess that is part of the tradition too!\n\nThank you for a wonderful program which brought back sweet memories and made me realize that the present will one day also be a lovely memory for me. \nI am so proud to be Jewish!   \n\nA Zissen Pesach to all!",
    "nam": "Janet",
    "loc": " North Salem, NY",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Mavens",
    "mes": "How lovely it would be for an aging cook to meet these wonderful women, spend some hours and learn!",
    "nam": "David Hutson",
    "loc": " Kansas City",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Awesome Family!",
    "mes": "I first discovered this program one night last year (2010) when I was suffering from a bout of insomnia.  I was so glad to have had the viewing experience of this wonderful family!\n\nI just wanted to say thank you to the creators of this documentary for showing that families still honor age old traditions.  You&#039;ve captured your family in such a way that it truly touched my heart!\n\nI&#039;ve already set a reminder time for this year&#039;s viewing and I can&#039;t wait to watch it again.\n\nLaura Cox",
    "nam": "Laura Cox ",
    "loc": " Tampa, FL ",
    "email": "laurajustice33613@yahoo.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "I love this family",
    "mes": "Every year, it is my tradition to play, &quot;The Gefilta Fish Chronicles&quot;. It wasn&#039;t my home but it reminded me of home.  The fighting ...the loving...the warmth... this family travels thru the DVD into your heart. Want a big happy Passover meal without the heartburn? Buy this DVD.",
    "nam": "Pat Berkman ",
    "loc": " Lebanon Township, NJ ",
    "email": "pberkman4@gmail.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Gefilte Fish for Christmas!",
    "mes": "My Polish Catholic family ate Gefilte fish on Christmas Eve. My babcia, a solid peasant woman, would make it with the help of her four daughters beginning a few days before.  It was her signature dish and always served with fresh horseradish and rye bread.  I remember going with Babcia to the fish mongers in N.Y.City and watching her argue with them, in her preferred Polish, the finer points of fish freshness.  As far as I knew, the family always ate gefilte fish on Christmas Eve since forever. So, the old wheeze, &quot;You don&#039;t have to be Jewish&quot; really has legs in my family.  An ethnographer would love this story of crossed traditions.",
    "nam": "Tom Schmidt ",
    "loc": " Chicago ",
    "email": "Tschmidt@Temprite.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "My deepest sympathy!",
    "mes": "I&#039;m so sorry to hear of Rosie&#039;s passing----as I have often watched &quot;TGC&quot;, I have fallen in love with the feisty dames who prepared the Seder feast and Rosie and Peppy seemed especially close, Rose parlaying Peppy&#039;s good-natured barbs, and laughing uproariously.  How you all must miss her!!!  How is Peppy?  She is the last of The Old Guard, may she live forever.  One day, all the children will be with their beloved parents in Heaven.  May the Creator bless all of you!",
    "nam": "Joan",
    "loc": " Ohio",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Home Cooked Food",
    "mes": "Growing up, I was Catholic, my best friend Jewish.  We lived out of each other&#039;s homes and at age 55 we still are in touch once a week and love each other more than ever- since age 5, no less!  She says laughingly that I am a better Jew than she is!  I especially want to learn to make great cholent, brisket and honey cake.  She lives in New York City now, and has lots of options for good home cooked food.  I am happily getting ready to learn the fine art of Jewish cooking so I can have those dishes long remembered.  Your video with your family is amazing.  God bless all of you for generations to come!",
    "nam": "",
    "loc": "",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Brooklyn Patasniks",
    "mes": "Unfortunately I have not seen the video but saw the Patasnik name while I was searching for my first girl friend, Myrna , when we were very young in the 1940s at about ages 4 and 2. I know her  Daddy, William (Bill) was from Boonton and still had family there when I was a kid. Momma Sara&#039;s family, the Rosenbergs, also lived in the same 4 family building at 290 Grafton St as they did including younger sister Rhona. Bill drove a cab and 25 years later I remet the Patasniks when they owned a dry stationery store in the Trump Village Shopping Center on Neptune Ave in Brooklyn. Would like to connect with Myrna, Rhona or any of the Rosenberg family children: the Maclins or the Mastrangelos.",
    "nam": "Robert (Bob) Kirschner ",
    "loc": " Lake Worth, FL ",
    "email": "bobkaye04@msn.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Bless You All For Sharing",
    "mes": "I recently saw your program on KCTS Channel 9 out of Seattle, and it struck such a strong chord of hope with me.  I&#039;m not Jewish and know very little about the seder, but I saw my Romanian childhood in your family&#039;s love and closeness.  That experience is exactly what we ALL need today.  Bless you all for sharing your wonderful example -- the hugs AND the bickering -- with the rest of us.",
    "nam": "Connie",
    "loc": " Bainbridge, WA",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "THANK YOU!",
    "mes": "I enjoyed this program more than any other I&#039;ve seen in a long time.  The importance of family, and of tradition is made so clear by this amazing family.",
    "nam": "Kathy Erlandson",
    "loc": " Olympia, WA",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Thank you!!!!",
    "mes": "Thank you, all of you, for bringing me back 60+ years to my father&#039;s family (especially my Aunt Dottie). I had all but forgotten some of those Friday night dinners in Brooklyn at my grandparents&#039; home...",
    "nam": "Kathe Stein ",
    "loc": " Tacoma, WA ",
    "email": "kstein@harbornet.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Wonderful to Watch",
    "mes": "I just adored watching the sisters, their love of family and tradition, their closeness, and their humor and knowledge.  What a pleasure to watch again and again.  I will be ordering both DVD and cookbook.  I am Catholic and their love of their mother and father reminds me of how much I love and miss mine.  I&#039;m not Jewish, but boy I sure wish I was!",
    "nam": "Suzanne Jones ",
    "loc": " Seattle, WA ",
    "email": "suzanne.jones@seattlechildrens.org",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "May I came next time?",
    "mes": "I loved this...OMG...&amp; I&#039;m an Irish Catholic gal...I watched this on Easter &amp; had such a great time...LOVE your family...and was very hunger after the show...pls chronical more of your fablous families, well maybe not that bris thing..a weeding would be nice!",
    "nam": "Jane Givens ",
    "loc": " Seattle, WA ",
    "email": "jmueller@stjosephsea.org",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "I can't wait to get the cookbook!",
    "mes": "I watched your show tonight. WOW!! I do most of the cooking in our house, and have several Jewish cookbooks. I look forward to adding yours to my collection. Yes, I do use everyone of them all year long. Next year (2011) I plan to suprise my wife with your recipes. I can not count the number of times she said &quot;that is my Grandmother&quot;, or &quot;What memories this show brings back&quot; (through many tears, of course). I want to thank you for sharing, and can&#039;t wait to tell you (a year from now) how it turns out. God Bless you all.",
    "nam": "Clark K. ",
    "loc": " Drexel Hill, PA ",
    "email": "oldbaldy125@comcast.net",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Thank you for reminding us what holidays are for...",
    "mes": "Although I&#039;m just a goy, I throughly enjoyed your program. I only experienced one Passover seder, and never realized the significance of my religon and the fact that the Last Supper in Christianty was most likely Passover. I ponder this each year at this time, and the parallel paths, we all as people of faith, take.  And that everyone should take part in a Passover Seder once in their lives.  \n\nBut enough about religion, the food ladies - oh my! Growing up in Queens NY - I know good food and oy, my mouth was watering watching the meals your family created with care, humor and &quot;just a bit more salt&quot;.  And my eyes teared when I realized that it was not the meal, but the history and tradition and love that sits around the table that makes it all special.  Many blessings upon your home and family and loved ones, today, and every day and may you continue to celebrate together - forever!",
    "nam": "Sarita",
    "loc": " Santa Barbara. CA",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "God Bless You All!",
    "mes": "My grandfather Sam ground Horseradish (Chrain) for his south Philadelphia neighborhood for decades until he retired. Then he taught me and I ground Horseradish for my extended family and friends until everybody moved away to different states. Watching your video made me cry, your Seder was so wonderful. God bless you all!",
    "nam": "Bob",
    "loc": " Allentown, PA",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "How lovely!",
    "mes": "I enjoyed this show very much. It made me think of my family, though I am Italian not Jewish, but things are very similar in both ethnicities: family and food. I turned it on half way through and now I will look for it again to watch it from the beginning. Happy Passover!",
    "nam": "Vinnie Lobascio ",
    "loc": " Minneapolis ",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Loved the Show",
    "mes": "I watched The Gefilte Fish Chronicles today (23 Mar) for the first time and I was so moved by the joy, the family togetherness and the love throughout.  I laughed and cried it moved me so.  I never experienced a Seder with family but I intend to start doing this with my own son and his fiancee G*d in Heaven willing, this year.\n\nThank you so very much for the blessing your show and family has given me.\n\nShalom,\nDonP",
    "nam": "Don P",
    "loc": " Oneonta, NY",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "I DO THE SAME IN MY KITCHEN.  LIKE YOU.  LIKE MY MOM.",
    "mes": "Would you want to invite me to your kitchen?  I remember when my mother cooked, especially for the big Jewish holidays, she always sang in Yiddish.Do you sing? My mom would say, mastering her gefilte fish, in Yiddish, “Mi daf arangileigen a neshume zale ubn a fish a yiddisher tom”\n        In my free translation to English: “ It doesn’t matter whether this fish is from the river or the sea.  But you need to give it an Yiddishe zest.”\n\nAnd this is exactly what your program is about - an Yiddishe zest and aroma!\n\nElizabeth, Florida",
    "nam": "Elizabeth Fortun ",
    "loc": " Palm Coast, Florida ",
    "email": "matchmaking@cfl.rr.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "From Boonton with love!",
    "mes": "I met &quot;the girls&quot; when I first moved to Boonton in 1968 and Rose, Fritzie, Sophie and Helen were all active in the Sisterhood at the Boonton Jewish Center (of which the Dubroff family were fouding members). I remember Mrs. Dubroff on Yom Kippur, sitting near the window on the right side of the Temple so she could see, silently praying and &quot;shuckeling&quot; and fasting ALL DAY LONG! The sisters always presented themselves as classy, well coiffed, dressed, bedecked and bejeweled. What a joy! The DVD revived such wonderful memories. Thank you.\n\nBarbara Jerchower",
    "nam": "Barbara Jerchower ",
    "loc": " Cary, NC ",
    "email": "bjerchower@nc.rr.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Thanks for the Memories!",
    "mes": "During a chance flip &quot;ON&quot; of the TV clicker to my favorite Milwaukee PBS station I was blessed by seeing a about 15 minutes of the end of The Gefilte Fish Chronicles. Since then I&#039;ve been accused of looking more like my waddling, ever-begging &amp; drooling basset hounds as my salivary glands have refused to settle down since seeing the delightful show. My previous husband Michael is deceased. It was his mother Lorraine Maultz Rocca, her friend Rita, and her family who shared my first Seder dinner with me, a Goy, and my sister-in-laws Cathy Rocca &amp; Priscilla Perl Rocca (Dennis) who gifted me the meanings of Pesach and made my Seder dinner memories deep &amp; meaningful even in the framework of my Christian Faith. For through these experiences I learn we have so much more in common that binds us together and we can learn to celebrate and focus on that as we educate each other on those few differences.  In the meantime GFC... Now that you roused my memories &amp; basset hound salivary glands..SEND EMERGENCY CARE PACKAGES STAT!  Gefilte fish, Matzo Ball Soup, and Chopped Liver.  HELP! Am a GOY WHO CAN&#039;T COOK !!!  Sandra Seyfarth-Lechner (formerly Rocca of Lincolnwood, IL)",
    "nam": "Sandra Seyfarth-Lechner ",
    "loc": " Lake Geneva,WI ",
    "email": "sjslrn@gmail.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "What a Surprize, What a Joy",
    "mes": "Thank you so much for the clarification (about the cucumbers!) and the additional advice!\nWe really appreciate the prompt shipping and the lightning response to our question.\nThe &quot;Gefilte Fish Chronicles&quot; is a delight and we are grateful to you and the entire Dubroff clan for sharing your experiences and your recipes with the world!\n\nAs we wrote in our first e-mail after watching the GF Chronicles:\nWe laughed.\nWe cried.\nWe got hungry.\nWe ordered the DVD and the cookbook.\nAnd we’re so glad we did!\nAll the best,\nChuck &amp; Lee",
    "nam": "Chuck and Lee",
    "loc": " Brookline",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "What a coincidence!",
    "mes": "I love it! Touching and fun, and what an amazing family you have. Thank you for having the love &amp; smarts to share it with the world. I’m as impressed with the way it’s put together as I am moved by it. Really good stuff on the website too – looks great. \n\nAND get this: so I’m sitting here watching the dvd and loving it... so I call my mother-in-law to say how she needs to see it... and she points out that our Cousin Nancy saw it on PBS and it’s completely the reason we had a huge family reunion for Seder this year... totally changed the family’s approach to this holiday. How funny is that? :-)",
    "nam": "",
    "loc": "",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Dear Folks...",
    "mes": "I laughed, I cried. What a great story and family. The two remaining sisters are dynamite!  Humor, love (or reverse the order) and all the wonderful attributes this has... Thanks to the producer...",
    "nam": "Geri",
    "loc": " Silver Spring, MD",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Many Thanks...",
    "mes": "Thanks so much for everything! Almost instant shipping. I don&#039;t know if Kai is the distributor or also the producer/director of this documentary...but if anyone can hear me out there, this has given my 85- and 88-year-old mom and dad, respectively, so much joy, that I had to let you know. They are both originally from Brooklyn and out of necessity transplanted to Maryland, so it&#039;s great to give them a touch of home, which this did and then some. We&#039;ve watched together twice and we keep hearing something new and different. The only thing is...maybe it needs a little more salt :) Thanks again. Linda",
    "nam": "Linda F",
    "loc": " Maryland",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "OOPS.. to all of our patrons.",
    "mes": "Today (Wednesday April 15th) in an effort to clear the past year&#039;s listings on our GOOGLE Checkout account, some of you may have accidently received a &quot;SHIPPING &amp; CHARGES&quot; notice from GOOGLE concerning your purchase of Gefilte Fish Chronicles over the last year.  You are NOT being charged anything -- unfortunately, in a bid to &quot;archive&quot; these dormant files, Shipping notices were sent to you.  Please think nothing of it. You aren&#039;t being charged a second time.  Once is enough, right!?  Thanks for your patronage, and we&#039;re sorry if this caused you any minor inconvenience.\n\nDavid B.  /  The Gefilte Fish Chronicles",
    "nam": "David",
    "loc": " Gefilte Fish Central",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "I want to see this",
    "mes": "Hi Ya&#039;ll, I didn&#039;t see the film on PBS  as I am living in Austin, TX since last summer. However, I was part of the family in Boonton, NJ. I was Sheila&#039;s BFF and went to many seders at the Patasnik residence, knew all the cousins well, babysat their children , worked at Boonton Handbag one summer. My sister, Gail Pollack Levin was a close friend of Iris&#039; and I knew her as well. Aunt Rosie\n(and Uncle Milton), Aunt Helen (and Uncle Phil), Aunt Fritzie( and Uncle Eddie) and Aunt Shopie (and Uncle Joe) were my mother&#039;s best friends and they werea part of my life growing up in a small town with few jewish folks. We were part of a small community. I stayed at Aunt Peppy&#039;s house with Sheila to visit with Lovey on a couple of occassions and the 3 of us would hang out whenever Lovey was in town. Just reading everone&#039;s comments brought back many fond memories of my youth and sharing in the families traditions. Cant&#039; wait to see it. I was messing around on FB and Jeffrey wrote me back about Iris&#039;s blog. So, my love to all. I am a Nana now, finally! Had some gefilte fish last night...and it was not the same! Sara Pollack Pinkman",
    "nam": "Sara Pollack Pinkman ",
    "loc": " Austin, TX ",
    "email": "midwifesara@gmail.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Passover, a joy",
    "mes": "My family is very small - I only have my 88 year old mother and 90 year old stepfather.  They live in Florida and I&#039;m in Washington, D.C.  Their days of holiday preparation, let alone any meal preparation, are long over.\nSo this week was kind of lonely for me.  I have good friends, but it&#039;s not the same.\nLast night I was channel surfing and came across the 3 sisters cooking in the kitchen.  I had no idea what I was watching -- and I was loving it.  Couldn&#039;t stop.  Then I checked the info button, only to see I was watching PBS and I cracked up when I saw the title of the show.  I don&#039;t know how far into the show I tuned in, but it was long before the meat grinder broke.  Watching those bubbies arguing over which way the blade should face and then trying (successfully!) to put together the new one from Home Depot was priceless.  Even though my family has always been small, I have childhood memories of my late father leading the seder at my grandparents&#039; home in Florida.  Since he passed away in 1969, Passover has never had the same meaning for me.  Until watching the show last night.  I&#039;ve never seen anything like this in my life.  Old world meets 2006 (I saw the copyright date).  Old family pictures.  Remaining sisters (it broke my heart when they said that one of them had passed away since the filming) cooking &quot;with love&quot; and kibbitzing.  This needs more salt.  No it doesn&#039;t.  Hysterical!  Everyone sharing memories of past Passovers.  Mentioning past seder leaders and introducing the new ones.  And the eloquent speech made at the beginning of the seder. \nFor a while, last night, I felt as if I was part of a beautiful celebration, even if it was from my sofa.\nI laughed hysterically and I cried, too.  I was sad for all those times that can&#039;t be recaptured.\nYou asked if I liked the show?  Now you know!  I loved it.\nWas that the only show that was filmed?  The credits were hysterical.\nI bought the DVDs and cookbooks for my 2 best friends from childhood, my mother and me.  Since my mom doesn&#039;t cook anymore, I didn&#039;t get a cookbook for her.\nI hope that the family tradition never dies in that family.  And I hope that everyone appreciates all the love that surrounds them.",
    "nam": "Julie",
    "loc": " Burke, VA",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Greetings from a close neighbor!",
    "mes": "I just caught most of your documentary on our local TV station and was enjoying it so much, thinking how much it reminded me of the way holidays are with my own family and missing them this Easter... and then I was amazed to see how close you are to us! The Yanarellas across the river in Beacon have always done holidays very much the way you do (except for the religious elements -- we&#039;re mostly-Catholic Italians!), and between a handful of aunts and cousins, we try to keep all the 500+ of us together as much as we can. I&#039;m so sure some of must us have met some of you, so perhaps I should say greetings friends! It&#039;s so funny knowing two families so close together are so alike this way, even though we come from such different ancestral backgrounds. I wonder if it&#039;s something in the water? ;)",
    "nam": "Monica ",
    "loc": " Washington DC ",
    "email": "friarsghost@gmail.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Something else about family.....",
    "mes": "I just wanted to add something to my previous message: the sharing of and passing down family traditions and stories. I am so fortunate to have shared that with my grandparents, great-grandparents, aunt, uncle, parents....\nAnd I saw that in the program.\nFamily, to me is important not only for the love/sharing but, IMO, it&#039;s important to continue the traditions from one generation to another.\nUnfortunately, I think we&#039;re losing that in our mobile/throw-away society....and, IMO, we CAN NOT.\nThe family is, IMO, one of our national treasures. Whether your Jewish, Christian, etc.... yes, we need to get along with others and use tolerance but we also should have PRIDE in who we are and from where we came.\nGod bless, Happy Easter/Passover...and God bless out great country!",
    "nam": "Martha M. ",
    "loc": " Ohio ",
    "email": "mlmeacham@hotmail.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Thanks for sharing!",
    "mes": "I watched the film on PBS a few days ago, and I laughed and wept through it all. I could almost smell the horseradish! What a wonderful film; I felt like a guest at the Seder, and rejoiced at the unity of family.  Thank you!",
    "nam": "Linda N.",
    "loc": " Winchester, New Hampshire",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "LOVED YOU",
    "mes": "Absolutely loved watching you girls prepare the gefilta fish for Seder.  I am Catholic, and really appreciated all the effort and love that goes into preparing this meal.  You made me laugh so much and reminded me of my relationship with my older sister, who recently passed away.  We were much like you sisters, disagreeing a lot of the time, and laughing about it later.  It just shows you that whatever religion or race you are we are all the same inside.",
    "nam": "Linda",
    "loc": " Massachusetts",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Loved watching you.",
    "mes": "Absolutely loved watching you girls prepare for Seder.  I&#039;m Catholic, but I so appreciated all the work and LOVE that goes into your gefilta fish.  Also learned a lot about your faith and cooking.  You reminded me of my relationship with my older sister, who recently passed away, and how she and I interacted with each other.  We are all the same no matter what religion.",
    "nam": "Linda ",
    "loc": " Massachusetts ",
    "email": "snowjade7@hotmail.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Happy Holidays to all!",
    "mes": "Hi!\nI watched the program last night and thoroughly enjoyed it! To quote Tolstoy: &quot;all happy families are a like&quot;...and no matter your ethnic or religious background, that is certainly true! I come from a very close-knit Protestant/Catholic family which values family, good food, and love. I learned a lot about the Passover traditions but also saw that the family is THE most important unit in our lives.\nGod bless and I wish everyone a blessed holiday season....whether it&#039;s Passover or Easter. Enjoy with family and friends....and bon appetit!",
    "nam": "Martha M.",
    "loc": " Ohio",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Hello Mavens:",
    "mes": "This year, this wonderful film is not available to be seen in the NY metro area on television. My husband and I with the wonder of the Internet, we found the website to be able to own our own DVD of the film. And why not the cookbook too! Can&#039;t wait for the package to arrive! \nThought I am a Russian Orthodox Christian, grandparents from Russia, Germany and Poland, I see so many similarities in how familles interact with each other. The gratefulness of being together warms my heart. \nHappy Passover and God bless you to the Dubroff family!",
    "nam": "Lisa Olszowy ",
    "loc": " Flanders , NJ ",
    "email": "lolszowy@aol.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Amazing!",
    "mes": "Dear Mavens.............\n                              It&#039;s almost 2 am on Tuesday April 7,2009 and I just watched your film for the first time...I laughed so hard I cried....I have some very dear friends who are Jewish and have fond memories of  the first Passover I cooked for.....I was raised a catholic, but have always believed  I was really Jewish....I am Italian and as many  have said  the Italians and the Jewish people are alike in many ways.. I plan on ordering the DVD and cook book...Thank you for reminding us how important family is............I wish health and happiness for  your entire family this Passover....",
    "nam": "",
    "loc": "",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "I'm still laughing!",
    "mes": "I don&#039;t know what was funnier, watching the &quot;girls&quot; as they cooked and kvetched and kibbutzed, or reading the credits at the end of the show.  This was just wonderful and I enjoyed every second of it.  Boy, did it bring back memories.  As a girl who was raised by her Jewish grandmother, and then married an Italian, I can tell you that the two cultures are very similar.  But it did make me long for the days of sitting in my grandmother&#039;s kitchen watching her cook.  We used to tell her to make sure she kept the lid on the pot with the matzoh balls because hers were so light they would float away.  She would send me across the street to Sam the Fishman (In Philly) to pick up the fresh fish for her unbelievably good gefilte fish.  \n\nI miss you Grandmom! \n\nHave a wonderful Pesach everyone!",
    "nam": "Carol",
    "loc": " Palm Beach Gardens, FL",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Oy! Such love and laughter!",
    "mes": "Saw The Gefilte Fish Chronicles on PBS here the other day and thoroughly enjoyed it. Made me cry to enjoy the family traditions of your yearly Seder. God bless you all!",
    "nam": "Valerie Simons ",
    "loc": " Saskatoon, Saskatchewan ",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "LOVED IT!",
    "mes": "What a marvelous story of love, tradition and family!!!",
    "nam": "Kathy K ",
    "loc": " Richmond, VA ",
    "email": "smelling.roses@hotmail.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Thank you for a wonderful cry",
    "mes": "I just finished watching your moving documentary on PBS while doing my Pesach baking.  Thank you for sharing your beautiful family with us - it felt like my own family, though my mother was an only child after losing her mother and brothers in the war.  Our seders were always fairly small, but she, single-handedly, kept Pesach alive and it became our family&#039;s most favourite and special holiday.  After her passing 15 years ago, my sister and I strive to make Pesach a time of incredible memories for our 9 children.  I look forward to the day, 40 years from now, when we bicker over the amount of salt in the fish and, G-d willing, welcome our grown children, nieces, nephews, grandchildren and great-grandchildren.  May G-d bless you and your family.  I thank you for sharing your story with me.",
    "nam": "Cindy ",
    "loc": " Toronto ",
    "email": "cindy@josephfamily.ca",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "I AM SAD",
    "mes": "I am sad because I sit on my sofa alone, missing my brothers and sisters and mother and father who all live in the same city two hours from where I live. I am sad because daddy had a stroke and cannot speak.  I am sad because I am divorced and don&#039;t have that lifelong partner to celebrate with.  I am sad because I miss my family and feel isolated.  I am sad because I don&#039;t feel like I belong anymore.",
    "nam": "Cin ",
    "loc": " Richmond, VA ",
    "email": "cinnlt@aol.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Memories of Grandma",
    "mes": "Watching your film was like turning back the clock fifty years, to the kitchen with my grandmother, my mother and my aunts...All of the food, the loving bickering, the &quot;needs more salt&quot;, the schmaltze, the gribennas in the canedelach...and, although you didn&#039;t use the term, the retach (black raddish). My stomach ached and my eyes watered.\n\nHappy Pesach!\nLou Cohen, Foxboro, MA",
    "nam": "Lou Cohen",
    "loc": " Foxboro, MA",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Watch Gefilte Fish Chronicles this April",
    "mes": "Here is the preliminary listings for this year&#039;s broadcasts. Please share with your friends and family:\nThe schedule is as follows:\nWETA in the Washington area April 9 @ 9:0Opm\nWGBH  in Boston April 5 @6pm on channel 2 and 10:30pm on 44\nWPBT in Miami and Boca April 5@6pm\nKCPT in Kansas City  April 8 @10:30pm\nWCNY in Syracuse April 2 @ 9pm\nWCVE in Richmond April 1 @ 11pm and April 2 @ 10\nVermont Pub TV April 5 @5pm and April 6@9pm\nWSBE in Providence which reaches the S of Boston, the Cape and Vinyard\nApril 1 @ 8pm\nApril 3 @ 12am\nApril 5 @3am and 11pm\nApril 6 @ 2pm and 4am",
    "nam": "",
    "loc": "",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "I Just Loved Your Film",
    "mes": "I just had to write to you to tell you again how much I love your\ndocumentary. It\\&#039;s been a couple of years since\nI first received your wonderful documentary DVD (\\&quot;The Gefilte Fish\nChronicles\\&quot;...just love the title) about your family\\&#039;s preparation for\nthe Seder celebration and I just love watching it over and over again.\nYou have a very warm family bond that shows through in your video. I am\na first generation Chinese descendant but every time I see your DVD, I\nget a very warm and loving feeling inside that transcends racial\nboundaries. I can\\&#039;t say enough how well done your documentary is\nand how much I enjoy watching it. Sophie, Peppy and Rosie are just\nwonderful. Seriously, you should have gotten an Emmy Award for it.\n\nYou have a wonderful family and I hope you all have a very full and\nprosperous life, filled with many\nyears of Seder together. Take care.",
    "nam": "Connie Gee",
    "loc": " New York",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "WHO CAN I MARRY TO GET INTO THAT FAMILY?",
    "mes": "What a wonderful film and family.  Everyone should see it to understand what \\&#039;family\\&#039; means...Jewish or not....",
    "nam": "Marcia Blackman ",
    "loc": " San Rafael, Calif. ",
    "email": "moosmarcia@hotmail.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Wonderful Memories!",
    "mes": "What a terrific film!  I&#039;m speechless!  I grew up with Honey and Rosalie as good friends.  How great to see the whole family again.",
    "nam": "Judy(Corigliano)Rada ",
    "loc": " Sanford, NC ",
    "email": "judysails@charter.net",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "The motazoh ball girl and the 4 questions people",
    "mes": "Man oHH man the girl that ate all those matzoh balls is so cool. And the little boy and the girl who sang the 4 questions were so cute. I wish i was in the Family. Peace be with you all and a Happy 2009 passover",
    "nam": "Ns",
    "loc": " Tr-State Area",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Amazing and Heartwarming",
    "mes": "I saw the &quot;Gefilte Fish Chronicles&quot; on Channel 13 last year around the start of Passover and fell in love with the show.  I am a 31 year old Italian man who is a practicing Catholic, but as a child I was always with my grandmother learning how to cook the different traditional foods of our heritage.  I would love to listen to (and still do) stories about the family and the recipes that my grandmother and her sisters learned to make from their mother.  I was always told that Italians and Jews were very similar when it came to traditions involving family and food.  After seeing this show, and now owning the dvd, I am sure of it!  God bless Peshie, Rosie and their families.  May they continue to do this for years to come.",
    "nam": "Peter John Kost",
    "loc": " East Elmhurst, New York",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Wonderful Cookbook",
    "mes": "Hello Mavens,\n \n \nI just bought 2 cookbooks...and can&#039;t wait to do some cooking.  The recipes are the same ones my Nana once made.  Since she never wrote things down, just used a &quot;little of this and a little of that&quot;, I never had hopes of making all of the delicious foods I remember eating as a child (I am 46 now).  Now I can, thanks to all of you.  It is so important to keep our Jewish customs and history alive, pass things down for generations.  I deeply thank you all for the wonderful recipes and DVD.  When will there be more????!!!!\n \n \nToda raba,\n \nBonnie",
    "nam": "Bonnie",
    "loc": " Massachusetts",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "The Accidental Miracle",
    "mes": "I was on the treadmill, plodding away and clicking the remote when - lo and behold - on our local PBS, I stumbled upon the GF Chronicles.\n\nThis was on Sat., April 21, 2008, the first night of Passover. I taped the program (I missed some but came in while the 89 lbs. of raw fish was being delivered) so that I could share it w. family. This should get the Oscar for Best Documentary....I am the oldest (71) of my family left and the only one with memories of similar relatives and family gatherings. Everyone always talked at once. Many Synagogues in the Berkshires. I bet that they would love to show this film to their congregations.",
    "nam": "Gail Finkel Calder ",
    "loc": " Spencertown, NY 12165 ",
    "email": "gailcald@fairpoint.net",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Any relation to?",
    "mes": "Are you any relation to Michael and Andrea Dubroff? I worked for Mike and Adam Dubroff for many years in the hotel business.",
    "nam": "Monica Coughlin ",
    "loc": " North Providence, RI ",
    "email": "mmcoughlin@cox.net",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "OH! HOW I MISS MY TANTES!",
    "mes": "Like so many others, I chanced upon this delightful heartwarming programme. I thank PBS in Vermont for viewing it so that we in Montreal can share in it! So many wonderful memories...I grew up with all my great aunts and uncles ( lucky me!) and I was the founding member of our cousins club...oh so long ago. Now we are ( or I at least) are the &#039;elder cousins&#039; ( I don&#039;t look or feel it BUT my drivers license tells a different story!).. Will buy both the DVD ( oy vey...have to call my son AGAIN on how to use it!) and the cookbook...wish this would be shown in the Los Angeles area..so my grand daughters could view it too! At 12 and almost 16...they have missed all the wonderous years of belonging to a large extended family...so I offer them yours!!\n\nThank you for a truly charming and happy hour...",
    "nam": "Joy Moos ",
    "loc": " Montreal, Quebec ",
    "email": "moostrap@mac.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "A Perfect Mothers Day Gift",
    "mes": "I happened to catch your program and was glued to my tv.  I just ordered the DVD and cookbook for my Mom for Mothers Day.  My telling her about the program wasn&#039;t doing it justice...thanks for the opportunity to show her first hand.  Cannot wait for it to arrive!",
    "nam": "Jennifer Hill",
    "loc": " NYC",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Stunningly heart warming",
    "mes": "My wife and I laughed, cried and took notes! We can&#039;t remember anything that mirrored our own families as this program did. We accidently came across this program while taking a break from preparing for the arrival of our entire family for Passover. I&#039;m buying the video and cookbook, not that my wife needs it but it can&#039;t hurt. Thank you for this masterpiece.",
    "nam": "Barry  ",
    "loc": " Essex County NJ ",
    "email": "bhaus5453@yahoo.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "wonderful",
    "mes": "I stumbled on your show on pbs a few days before passover.  \nI LOVED IT!\nI was so moved by the entire family and all the love you have for one another.\nThank you for sharing your wonderful traditions.",
    "nam": "mara",
    "loc": " new york",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Saw this again last night 4-17-08",
    "mes": "This is a MUST SEE movie that brings so much back to the way it use to be years ago. I watched it last year for the first time and am going to order 2 copies today....1 for my 83 yr old Mom in Florida and 1 for myself. This is a Once in a lifetime DVD to watch for the Holidays if you are in your 50&#039;s and remember growing up with your Family around the holidays\n\n                              GREAT GREAT beautiful Video !!!!!!\n             ****************************************************************\n\n\n  &quot; wish it was still the same as it use to be back than &quot; !!",
    "nam": "Bob  ",
    "loc": " North Brunswick, New Jersey ",
    "email": "bob919344@yahoo.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "PASSOVER 2008",
    "mes": "Not a good chicken-soup year.  The chicken the butcher sent  didn&#039;t  smell like chicken..... Nu?  \n\nThat means I have to &quot;tend&quot; the soup add this and\nthat for  hours till it tastes like chicken soup . \n .... In between an addition of another garlic clove, and another sprig of dill, I changed the TV\nchannel, to see  on the screen the &quot;sisters&quot;.... having a &quot;discussion&quot; about grinder blades.   I was transfixed for the next\n45 minutes as I  recognized  in the  goings on in the  kitchen&quot; my own  Grandma, mother, aunts, and my sister and I......  \nCooking for the Holidays...... no matter which one is an &quot;event&quot;..... a happening...... All the problems of family, friends and \nthe world are discussed and solved inbetween the tasting, and &quot;discussing&quot; how much of what goes in,  when it goes\nin....to make the &quot;dish&quot; taste just like it did back in the &quot;old country&quot;....  I love your tradition of  favorite  Passover\nmemories..... Although our family doesn&#039;t  have it as a formal part of the evening,  Every year we tell the same stories\nof Passovers  past and make new memories for Passover next year.....Our tradition is always to set the table with\nextra plates, just in case we come across someone  new too invite.  Most years we happily make a new friend or two.\nSo thank you for letting me into to your kitchen....and your Passover..... Playing the Gefilte chronicles DVD  will be\na NEW tradtion for me  every year...... Have the sweetest of Pesach&#039;s.......",
    "nam": "Deb Schiffman ",
    "loc": " NY NY ",
    "email": "seaglass@mindspring.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Greetings from the Upper East Side of Manhattan",
    "mes": "I can not begin to tell you how happy it made me to see your families program today. It came at a very sad time in my life. My beloved brother Franklin passed away 5 months ago after taking a new anti-depressant..(he was only 56)..With so little family left, its only Mom and myself.... Mom lives in Brooklyn but stays with me most of the time.. She is an avid bridge player at the 92nd Street Y!!!\n    Seeing your program made me misty eyed for a life once full of family.... Everyones gone and the same type of family pictures you Mom was showing I have up in my closet... My Uncle Mitch, Dave, Tanta Laya and Tanta Dinah.... all gone.. Everyone is scattered across the country....\nI grew up in Brooklyn and went to Madison HS and graduated in 77...... It brought me back to a very very happy time full of family and good food..... I want to thank you and your Aunts for all the love they put into the program... It really shows!!]\n \n  Mom and I will probably go the Second Avenue Deli and pick up some food, but at least we have each other... I just ordered the cookbook and want to thank you for this  endearing show.\n \nLove, Robin and Helen Solod\n220 East 94th Street 3G",
    "nam": "Robin",
    "loc": " NYC",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Laughed and cried",
    "mes": "What a wonderful, joyous documentary.  It so remiinded me of cooking with my Nana.  My family is much smaller and many of the best ones are gone but I can&#039;t wait to start cooking for Pesach tonight - brisket, soup, matzo balls, chopped liver - I&#039;m having a heart attack just typing!",
    "nam": "Linda Silver ",
    "loc": " Bay Terrace, NY ",
    "email": "lsilver3@verizon.net",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "MOMALA",
    "mes": "I just ordered the book today. I love the show and it brings me back to growing up in Mill Basin Brooklyn....... What great times and great food.. ALmost everyone is gone but still have fond memories... Thank God for Leons bakery!!!! Thats what I always remember!!!! LOVE THE SHOW GALS!!! Keep going and just ordered the cookbook!!!!! Lots of hugs to you gals....",
    "nam": "Robi Solod ",
    "loc": " NYC ",
    "email": "tallblonde512@verizon.net",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Thank you.",
    "mes": "Your wonderful ladies and your families made me cry with tears both of laughter and sadness.  Passover seems to have lost a lot of flavor in my family since my mother passed.   You&#039;ve reminded me of what it&#039;s all about and I wish you and yours a Chag Semach.   \n\nPS, any single men in the family?",
    "nam": "Hannah",
    "loc": " Forest Hills, NY",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Thank You",
    "mes": "Dear Mavens,\n\nAfter watching your program last night it brought back so many wonderful memories of my own childhood and passover seders.  I didn&#039;t grow up in a large family but the food was a amazing!  I did however marry into a large family.  My father-in-law is the youngest of 10 children and my husband must have 1000 cousins.  We now have family seders of about 100 people every year.  Of course they have to be catered because on one can do all the cooking.  But lucky for us 1 of the cousins owns Zayas in Livingston, New Jersey and he does much of the cooking.  My husbands family will be celebrating their 100 in america this OCtober and we planning a large reunion with a bus tour of the old neighborhood in Newark, New Jersey.  After watching your program I think it would be a good idea to tape it so we can pass it on to future generations.  The oldest of the 10 children 96 and including her there are only 4 siblings left.   It is so important docment our Jewish history before its gone.\n\nThank you so much for wonderful program.  My husband and I commented that your Jewish kitchen is everybody&#039;s Jewish kitchen during the holidays.  I ubderstood every word spoken and not spoken.\n\nI wish you good health and a Happy Passover!\n\nG-d bless you,\nLaurie Halper\nBasking Ridge, New Jersey",
    "nam": "Laurie Halper ",
    "loc": " Basking Ridge, New Jersey ",
    "email": "halper4@optonline.net",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "What a Treat",
    "mes": "If you would have replaced the gefilte with calimari, the matzah ball soup with meatballs and sauce this would have been Christmas at my Grandma&#039;s house!  The similarities between this wonderful Jewish family and my Italian Catholic family are uncanny.  It was amazing how similar these ladies personalities were to my Grandmother and her sisters.  Thank you for letting us share in your family traditions - I know how important they are to our family and I&#039;m grateful that I was able to learn about yours!",
    "nam": "Jeff",
    "loc": " Minnesota",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Dear Ladies:",
    "mes": "I saw your show yesterday, and while I was laughing about the blade being backwards in your machine my sister called and said are you watching P.B.S.? I think sombody has made a story about our baubie and mom and auntie cooking in our kitchen.  The fish was historical because our dad had a kosher butcher shop when we were small.  I think we still have the chopper and the wooden bowl that our baubie used.   Thank you so much for all the memories.",
    "nam": "",
    "loc": "",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Your Program",
    "mes": "I happened to wake up very early this morning - around 4:30 am and turned on our public television channel.  Your program was running, and I became enthralled.  Very much like holidays with my husband&#039;s German/Norwegian Lutheran relatives.  I enjoyed it very much.  Keep up the good work.  How lucky you (and I) are to have such wonderful families!",
    "nam": "Jane Letson ",
    "loc": " Minnesota ",
    "email": "janeletson@msn.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "This documentary brought back so many memories!",
    "mes": "Ladies, I absolutely LOVED your show &quot;The Gefilte Fish Chronicles&quot;!  It was both &#039;endearing&#039; and &#039;funny as all get-out&#039; at the same time.\n\nYou see, I am a Roman Catholic, but my wife was a Hungarian Jew....and I quickly grew to love her family when we were married in 1973.  My beloved Lynn died in 1992 after being in a vegetative coma for 4 1/2 years, and my memories of her and her wonderful family have been colored with the sad images of those last years of her life -- until this weekend!\n\nWhen I saw your documentary on WNET television (a PBS station) about your family&#039;s traditional preparations for Pasache, my mind started flooding with such happy memories -- I coudn&#039;t begin to tell you how wonderful I felt!  This show of yours made me fall in love with the Jewish people all over again!\n\nMay God bless and keep you all in His good graces -- forever!",
    "nam": "John Donlan ",
    "loc": " Clifton, NJ ",
    "email": "johnd@newinstruction.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "CHAG SAMEACH FROM KANSAS CITY2008",
    "mes": "We finally got to fall in love with your wonderful family, and of course bring back memories of Seders past, when parents and grandparents(blessed be their memory) were still with us.  I have to admit, I was awe struck seeing anyone still cook with shmaltz, and those wonderful crunchy griebenitz (spelling?). \nCongratulations for your Mitzvot filled lives, your wonderful family, and thank you for the reminder of the importance of holding on to our traditions.",
    "nam": "Carolin  ",
    "loc": " Kansas City, MO ",
    "email": "caraskc@msn.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "CAn I come over? I want to be invited!!!!!",
    "mes": "I have a very non inviting Jewish family! I&#039;m sad! cAn I come? I can cook! :) I have a cabin in Hunter!\nI&#039;d love to meet you all!!!!!",
    "nam": "Roberta ",
    "loc": " New York, NY ",
    "email": "pawtraits515@aol.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Love it, Love it, Love it!",
    "mes": "Last Passover in 2007, I stumbled upon this wonderful documentary.  I just adore the sisters.  They have inspired me to instill the importance of strong family ties and warm gatherings in my three sons who are all in or entering their teens (one will become a Bar Mitzvah in 6 weeks. OY!).  Happy Passover to all 2008!",
    "nam": "Janice Hurowitz ",
    "loc": " Plainview NY ",
    "email": "CJWITZ@AOL.COM",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "I loved it!",
    "mes": "Watched the Chronicles today for the first time. Loved it! I was raised by a Jewish mother and Italian father. Have wonderful memories of both. You should have won awards for this production and the end credits were every onion, carrot, potato and horseradish that was shredded to make this magnificent documentary. I am buying the DVD and cookbook. The italian version of this movie is called &quot;9 Good Teeth.&quot; Different, but the same. Bless all of you.",
    "nam": "Deborah Ries ",
    "loc": " Howell, NJ ",
    "email": "ries917@yahoo.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Pure Joy!",
    "mes": "I loved, loved the Chronicles and love, love your family. This was truly a recipe for family happiness.\n\n\nPeace and Simchas",
    "nam": "Neil Platt ",
    "loc": " New Jersey ",
    "email": "myplatt@verizon.net",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Love you ladies! ",
    "mes": "Dear Kitchen Mavens: I just loved your film and I&#039;ve ordered your cookbook! I&#039;m hoping to be able to cook those cherished recipes almost as nearly good as you ladies! But of course it will only be with my sweaty determination and your ever loving good feelings flowing through the heavens that I&#039;ll be able to come close to what your dishes taste like! Thank you for sharing yourselves with us! I enjoyed and love you immensely!\nStephen",
    "nam": "Stephen Wagner  ",
    "loc": " 61 East 3rd St., #7 NYC ",
    "email": "stash0022@aol.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Loved the love in celebrating family!",
    "mes": "One night last year, as I was falling asleep with the TV on, I heard various family voices talking about Jewish customs associated with a holiday that I was vaguely familiar with but knew little about. It woke me up and I was so interested that I watched the entire program and loved it! Afterwards, I went on line to see if I could find out anything about the Chronicles but there was only the listing in the NY Times. I really wanted to get a copy of the documentary but nothing was available. I&#039;m so gratified that PBS has rerun the film and that you&#039;ve been able to produce a DVD of your family&#039;s love for it&#039;s customs. Thank you so very much!\nLove you guys! Stephen",
    "nam": "Stephen Wagner ",
    "loc": " 61 East 3rd St,  #7 New York, NY 10003 ",
    "email": "stash0022@aol.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Cholent!",
    "mes": "I loved this film.  Once, on a dare, I made cholent - and it was amazing!  I used fresh eggs and they turned a perfect brown.  I started it Friday night and we had it for dinner Saturday.  There was so much leftover, I brought it towork Monday and the entire office loved it - Jew and goy alike.  I ordered the cookbook because I want to try the cholent recipe (but I won&#039;t use 30 lbs of brisket!) - the dumplings/stuffing in the film intrigue me.  I loved the lines: Everything in the cholent has the same taste when it is served, and, Lifting cholent is an arobic exercise, like Tai-bo and Kick boxing!  Thanks so much for making this film and sharing your family life with us.",
    "nam": "Susan Morris ",
    "loc": " Brooklyn ",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Great Neighbors!",
    "mes": "It was a wonderful trip down memory lane for me last night. The wonderful family story of my next door neighbors in Boonton, NJ brought back great memories of a lovely time and place to grow up. I was the little girl next door that visited with the families and felt right at home with the cousins and extended family and friends of the Dubroff family. The love extended to others as well to make a happy environment for all who knew them. God Bless You All! Congratulations to Iris Groman, my childhood friend for making such a touching tribute to her family. It was hilarious and entertaining!",
    "nam": "Gail Sutton Kuchavik ",
    "loc": " West Orange, New Jersey ",
    "email": "GKuchavik@aol.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "PASSOVER SEDER",
    "mes": "LOVED,LOVED, LOVED the show. It reminded me how close my family was years ago when my grandparents were still around. I give all the ladies alot of credit. It&#039;s not easy work and I don&#039;t think I could stand on my feet that long anymore and I am only 57! I was just wondering where the butcher shop was where they went to buy their meat. Thank you again for this show and for the tears of joy!",
    "nam": "Sharyn Skolnik ",
    "loc": " Flushing, NY ",
    "email": "electchester@yahoo.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "What a beautiful family!",
    "mes": "I saw the last half of this last night, and all I can say is, what a beautiful family!  I was reminded of my own big family and our Seders, sadly a thing of the past as so many are no longer with us, and it made me long for Pesach.  I&#039;ve just ordered the DVD and look forward to showing this to the rest of my family!",
    "nam": "Susan",
    "loc": " New York",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Yasher Koach to the sisters!",
    "mes": "May you continue until you&#039;re 120! My husband and I laughed and cried and throughly enjoyed the Gefilte Fish Chronicles! He remembered his family circles just like this family, with all his aunts in the kitchen.(It could have been his family) We have 3 grown daughters, with whom we all cook &amp; prepare and make memories, and now a new grandson in time for this pesach. Thank you for sharing.",
    "nam": "Ellyn",
    "loc": " Long Island, New York",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "No Clearance in Boston...",
    "mes": "What&#039;s up with that?",
    "nam": "Eric",
    "loc": " Brookline",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "How Can I Thank You?!",
    "mes": "Dear David, Iris and Family, How can I thank you for an evening of joy, laughter, tears, memories and so much more.  I am a member of the SI JCC. Lois Scwartz coordinated an evening built around your DVD.  We knew it would be a special evening, but we had no idea how special, how charming and how rich.  As i saw the moovie, I thought about my own family and my own family celelbrations which I had as a child.  My grandfather looked like your partrarh as well.  My family, the Resnick Family also had three sisiters.  They are all gone now.  My mom was the last and she is gone four years.  yet, you brought back the joys of the holidays to me and to all who wweere at the j that evening.  TRhe traditions may differe form family to family, but you reminded us of the spirit of being a Jew, being part of a Jewish family and celelbrations  together.  If I may, i want to share a memory with you-I was the youngest cousin and thus, had to say the four questions every year.  finally, I had a younger male cousin.  Finally, at one seder, I heard my cousin robert speak.   Oh, I piped up, he is talking, can he say the four questions???? Well, my uncle answered me - Robert is only 2 years old, let&#039;s wait a few years!!!!!! Somehow for those years that I said the four questions, I always found the matzoh as well!!!!\nThank you - The Gefilte fish chronicles was a delight. Tears and laughter mixed and the huge turnout at the J thoroughly enjoyed the evening.  I thank you. \nIt would be my honor to hear from you.  You touched  my Jewish heart.  I wish you and your family much health, happiness and many more holiday celebrations for years to come.",
    "nam": "Bonnie Bender",
    "loc": " Staten Island NY",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "If GFC is NOT appearing on your local PBS station",
    "mes": "We would encourage anyone who wishes to see The Gefilte Fish Chronicles on their local PBS station to make them aware of your interest.  The film is being distributed to PBS stations around the country (so far 13 have accepted it, but none west of Kansas City, curiously) by American Public Televsion, in Boston.  But for the most part, stations do react to the urgings of their viewers.  We hope to see it on more screens, and you can help make that happen.  We had a wonderful showing in Voorhees (near Cherry Hill) New Jersey this week at the Katz JCC Film Festival: Thanks to all our viewers and supporters... If you leave a note here, please leave your email so we can contact you.... David &amp; Iris",
    "nam": "David Burnett",
    "loc": " New York",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "WHY...NOT...HERE....?",
    "mes": "As a transplanted New Yorker, now living in Denver, CO., I still retain a \na basic membership in New York PBS Channel 13.  I notice, from their program guide, that your wonderful programs will be on in NYC....but NOT here in Denver Colorado, (I checked the PBS station here!)  Denver&#039;s population is 1/3 Jewish....and ANYONE with any family feeling should be able to enjoy your program!  Please be on here, as well!!!!!  \n    Thanks for producing your show!  &quot;Nachas&quot; for Passover....and always! (( : )\n                (....a yamulka-wearing smilie, in case you can&#039;t decipher it!)",
    "nam": "Esther Nash",
    "loc": " Denver, CO",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Staten Island Jewish Community Center ",
    "mes": "The Bernikow Building Social Hall was filled with active adults who tasted Kosher for Passover Wine and gefilte fish and cheese. We just loved watching this heartwarming video. The expresseions of the active adults went from laughter, to tears and back again. . We will cherish this evening. The memories of this holiday were the common thread that the movie reaffirmed in all of our hearts. Thank you so much for sharing it with our community. Your family is now a part of our family. Many of the reviews identified the similarities within in their own family tradition.  We loved the dialogue and the sharing and caring that is so evident throughout. Happy Passover to all.",
    "nam": "Lois Schwartz",
    "loc": " Staten Island ",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "New Traditions",
    "mes": "I saw the video last year before Passover and loved it!  It brought back memories of Boonton, my mom, my aunt and you their friends.  I am now ordering a copy for my new daughter-in-law who is Catholic and never experienced the traditions of Passover of yesteryear.  \n\nWe have since started a new tradition since my mom’s illness prevented her from actually sitting at the Seder table.  Our first Seder in “the round” - on floor cushions or wherever anyone could find a seat - was in the den of my house when my mom was too sick and watched from the couch. She is ever in our thoughts as we continue that “new” tradition year after year.\n\nThis video absolutely will be a classic!\n\nHoney (Swillinger) Ullman\nSomerset, NJ",
    "nam": "Honey (Swillinger) Ullman ",
    "loc": " Somerset, NJ ",
    "email": "hullman@patmedia.net",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Cherry Hill, NJ screening,  April 1, 2008",
    "mes": "If you happen to live near Philly or South Jersey, there is Gefilte Fish news.\nThe  Gefilte Fish Chronicles will be shown at the Cherry Hill Volvo Jewish Film \nFestival of the Katz JCC, on Tuesday, April 1.  The screening is scheduled at 1 pm.Get in touch \nwith the Katz JCC in Cherry Hill for details.",
    "nam": "David B",
    "loc": " NY ",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "It's All about Love",
    "mes": "The sisters have so much love that it can make you cry - every bit of energy they put into that seder was oozing with affection for generations of their family members - I only hope that their children and grandchildren keep the traditions going - that would be the greatest testament to these amazing ladies.",
    "nam": "Susan",
    "loc": " Baltimore",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Bravo!! Wonderful production.",
    "mes": "Saw picture in the Forward newspaper and watched both presentations of The Chronicles on TV. Brought back many pleasant memories of the past in Brooklyn. The Dubroff family were very special people and dear to many. I have many fond memories of my relationship with them.",
    "nam": "L. B. Beck ",
    "loc": " Connecticut ",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "A note from Peppy",
    "mes": "I just wanted to say how wonderful it is that so many people have enjoyed the story of our family&#039;s Passover celebration. I am delighted to have connected with old friends and to have heard from so many of you that are dear to my heart.",
    "nam": "Peppy Barer ",
    "loc": " Newburgh, N.Y. ",
    "email": "ruthlove7@hotmail.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Hi Aunt Rose!",
    "mes": "Love ya, and loved workin&#039; on the Chronicles!",
    "nam": "C Coulon ",
    "loc": " B-more ",
    "email": "christian@zworg.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Thanks Mrs. Barer",
    "mes": "Dear Mrs. Barer,\nJust a note to let you know how much we all enjoyed watching The Gefilte Fish Chronicles.\nThree generations of Greenspans, ages 8 to 88, sat silently in our den as you told your very inspiring and heartwarming story.\n \nMay you continue to grind, chop, taste and season for many years to come.\n \nSincerely,\nEileen G.",
    "nam": "",
    "loc": "",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "And a Thanks to all of you",
    "mes": "Rose Groman (aka Pesach Macher #2) wishes to thank all of you who have enjoyed the film and made such lovely comments here on the website. We&#039;re hoping to have a Gefilte Fish &quot;Cook Off&quot; in the near future.",
    "nam": "Rose G.",
    "loc": " Boonton, NJ",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "This Is Family ",
    "mes": "To know this special family is one thing;but,to be part of this loving\nfamily is even something extra special.We only watch from the outside,but\nwhat and when we are allowed to get a peek on the inside, oh what a treat.\nIt is quite an experience as one can learns from this film.What you see is what\nyou get.There is no pretending.(forgive us,we can&#039;t spell hachmachs correctly).\n\n&quot;The Gefilte Fish Chronicles&quot; should wind up becoming a classic.\nIt brings to heart what love and tradition is all about regardless of what faith.\nTo life!To life!",
    "nam": "",
    "loc": "",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "To Make Pesach",
    "mes": "I read about the Gefilte Fish Chronicles in the New York Times and made it a point to catch in on Sunday eveing. And am I ever glad I did! I sat and watched the show laughing out loud and tearing up at the same time. As I watched the ladies so lovingly recall Pesachs of the past I was reminded of my own Grandmother who &#039;made&#039; the holiday until she couldn&#039;t anymore. Then, the torch was passed to my mother and aunts with a small read purse containing enough cash to buy what was needed to &#039;make Pesach.&#039; My mother and her sisters would first shop for weeks, and then stand in our kitchen up to their elbows in chopped liver and gefilte fish, while my Grandmother sat on a chair, often directing! The very same banter coming from Peppy&#039;s kitchen could be heard coming from our kitchen as well! Dicussion over how fine to chop, discussion over how much, discussion over just about everything! However, at the end of the day, when everyone arrived for the seder to sit at the long snaking table reaching from our dining room, through the living room and into the foyer, there were smiles, and a few tears too. Like Peppy and her family, thoughts of those who weren&#039;t there to share in the joy of the holiday were always in the forefront of their minds. But for my grandmother and for my mother and my aunts, especaially after Mom-Mom was gone, the point of it all was to &#039;make Pesach&#039; so everyone could be together. The film sent me home again to a time and place that doesn&#039;t exist anymore, and it made me appreciate those wonderful family memories with my parents, siblings, aunts, uncles and cousins. Thank you so much for preserving a small piece of our rich history. The Dubroff family is every family. Mazel Tov for bringing so much joy to so many with this beautiful film. I can&#039;t wait to share the DVD with my mother. She will cry.",
    "nam": "Amy",
    "loc": " Short Hills, NJ (formerly Philadelphia)",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Love is a family:",
    "mes": "Families have to have tyrants if the food is going to get to the table. Doing it with such love is the special way of the sisters. God bless and keep them and God bless Iris and David and Jordan, too.",
    "nam": "Joe Cowart ",
    "loc": " Deale, Maryland ",
    "email": "jose336@comcast.net",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "That was MY family!",
    "mes": "On the advice of my cousin, I watched the Gefilte Fish Chronicles.  I remember my grandmother making fish- after she used a baseball bat to subdue it  in the bathtub( how else could she be sure it was fresh?)I laughed until I cried because, even though I&#039;m not related to the Dubroffs, it was my family to a T. Anyone  wanting to relive  fond memories should see this show.",
    "nam": "Ronnie Lipkin ",
    "loc": " New York City ",
    "email": "Relipkin@aol.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "WHAT FOND MEMORIES",
    "mes": "I laughed cried and laughed just remembering all the wonderfull pesach&#039;s I shared with my family including 2nd 3rd and 4th cousins, as in this story, how special to know these people for me my grandparents 1st cousins.\n\nMemories like this are priceless, and I am so glad to have shared this Passover with a family that is similar to mine!!!",
    "nam": "David Marcus Pearl ",
    "loc": " queens (orig Brooklyn) New York ",
    "email": "dmarcusp@yahoo.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "MEMORIES ARE MADE OF THIS",
    "mes": "On April 1 I saw the last half this program for the first time and it brought back wonderful memories of my family - albeit somwhat smaller. Tivo&#039;d it so my daughter and wife could see it again and aain. I am ordering the DVD and Cookbook to send to my Brother-in-laws sho will plotz when they see it.\n\nYou should all live to 120 years in health",
    "nam": "Gene Herman ",
    "loc": " Fairfield, Ct ",
    "email": "hermang@snet.net",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Priceless!",
    "mes": "The other night I fell upon this show by accident and was immediately drawn in.  I called my 83 year old mother and told her to put it on. What a heartwarming look at a slice of Jewish life.  I loved the reminiscing, the old photos - it could have been anyone&#039;s relatives.  It&#039;s what Jewish families used to be, and it is so rare to see this today -- the Dubroff family is truly blessed.  Thank you for sharing this!",
    "nam": "Judy",
    "loc": " East Meadow,NY",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Thanks!",
    "mes": "Our usual Passover buddies were all out of town this year, so we had our seder with the Dubroffs! Watching the DVD just may become an annual tradition. What a treat. Thanks.",
    "nam": "Ellen",
    "loc": " New York",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Wonderful!",
    "mes": "My husband Ken is a chef, so I recorded the show and saved it to watch with him...we just loved it!  We live in Sullivan County now, but we both grew up in Orange (Middletown and Slate Hill).  We have started our own little family, and are working on building our own traditions and memories in the kitchen. Lots of love to the sisters and their families!",
    "nam": "Lynn Struble",
    "loc": " Sullivan County, NY ",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Thank You for a wonderful Sunday evening dinner :)",
    "mes": "I am not of any faith, however I am spiritual and I fully enjoyed being a guest in your house for an evening full of laughs, reminiscences, and tears. The love that was put into the food, family and tradition is something that we all need more of in this world and all three of you deserve much praise for carrying on your family tradition. Thank you for allowing me the opportunity to experience what a true Seder is. The meat grinder scene was priceless and I cannot wait to make Cholent...mmmmmm!",
    "nam": "Vincent C.",
    "loc": " Astoria, NYC",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "THIS IS FOR SOPHIE",
    "mes": "SAW THE CHRONICLES LAST NIGHT ON CHANNEL 13----LOVED IT---NOTICED THAT YOUR LAST NAME WAS PATASNIK----I HAD AN UNCLE, WILLIAM PATASNIK(BILL), MARRIED TO SARA WHO HAD TWO DAUGHTERS, MYRNA AND RHONA---HAVE THE STRANGEST FEELING THAT YOU ARE RELATED TO THEM...I AM THE DAUGHTER OF SARA&#039;S SISTER FLORENCE",
    "nam": "SUSAN SPIRO ",
    "loc": " HOWARD BEACH, NY ",
    "email": "SSPIRO6416@AOL.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Shaloam Malachem !",
    "mes": "I am not of the Jewish faith. I am Roman Catholic but I have to tell you that I watched your program last night and it was wonderful. I am a former New York City Police officer and to see a program about old fashioned family values and traditions was a refreshing change. There is too much violence and sex on TV and movies. Kids today have lost their sense of direction and don&#039;t know where they are going because too many of them do not know where they came from. When I watched you ladies, I saw my own Grandmother and when you spoke, it was my Babci that I heard. Alot of the foods and preparations brought back memories of Easter at my Grandmothers&#039; house, ( see that, gefiltefish and horse radish, and matzoa ball soup can be found on a Polish table too only we didn&#039;t have an electric grinder. We cranked ours by hand.) I was also born in Newburgh, and drove ambulances in Liberty and Monticello so seeing those places brought back memories also. Anyway, God bless you. Keep up the marvelous work. Our children need good examples to follow like you ladies.   P.S  If you are ever in need of an accordionist with a solid polka band, that can play Jewish music as well, give me a call at (845)726-3319",
    "nam": "Mark Lysogorski",
    "loc": " Westtown NY 10998",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Passover's Now Not Just for Jews",
    "mes": "I am a &quot;goy&quot; and my boyfriend is one of you,  Curiousity made me watch.  Love made me send copies to my Mom Portland, Oregon (she&#039;s a goy too).  May you ladies live to a billion and continue to feed that family that loves you as much as the gefilte fish (almost).",
    "nam": "East Village Shiksa",
    "loc": " East Village, New York",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Wonderful family and memories...",
    "mes": "I came across the movie by accident last night, just when they were at the kosher butcher &quot;debating&quot; the cut of beef! I was hooked and loved every minute of it. Couldn&#039;t wait to look it up today and get more information. They mentioned a relative in Poughkeepsie, and a meeting in Newburgh. I live in Beekman, about 20 minutes east of Poughkeepsie. A wonderful heartwarming and loving movie, I hope it gets more airing and publicity.\nPS I&#039;m one of 4 sisters prearing to go to my parents tonight for the seder. They are 90 and 91, married 61 years, still in the house in New Rochelle where we were all raised.\nHappy holiday to all.",
    "nam": "Bitsy Rosner Scigliano",
    "loc": " Beekman NY",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "My Family Was Just Like That!",
    "mes": "My warmest childhood memories were when my grandmother&#039;s sisters all got together at our house to do holiday cooking. They always spoke loudly and argued so much, that it scared me at first, until year after year, it became part of the tradition. Now, there&#039;s only one sister left, 98 years old, and the house is quiet and empty. Thank you from the bottom of my heart for your show, and allowing me to realize how important family traditions are.",
    "nam": "Dee",
    "loc": " Long Island, NY",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "I Love The Dubfoff Grandmothers!",
    "mes": "My 93 year old grandmother passed away just last month.  She was the one of the five Migdon children.  This made me think of how much she meant to me and all of us.  I live close by here in New Paltz New York and maybe I&#039;ll crash the Dubroff seder!",
    "nam": "Liz Pickett",
    "loc": " New Paltz NY",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "This reminds me of when my grandmother cooked",
    "mes": "For pesach and all other holidays.  She used too get the fish from my dad&#039;s store when he was in the fish business.  You can not get that anywhere what she had made,, Nor could we duplicate what she had made......Memories of a lifetime",
    "nam": "Melissa",
    "loc": " Upstate, NY",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Meat Grinder memories",
    "mes": "My wife fondly remembered her struggles with a hand cranked meat grinder as a girl in Bucharest, Romania.  Same style she says:  and girls, the blade was backwards!  Such a sweet family sotry; a great evening on PBS!",
    "nam": "Eric and Anca Askanase",
    "loc": " New York, NY",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "SO HEARTWARMING!!",
    "mes": "HOW WONDERFUL!  I&#039;m not Jewish, but it brought home the same message - family is all.  I loved the personalities of all the sisters.  When the show ended, I didn&#039;t want them to leave........",
    "nam": "Maria",
    "loc": " New York",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Aunt Fritzie",
    "mes": "My mother was born in 1914 to a family with 7 girls and one boy (born on Christmas). One of her sisters was Fritzie who like your Fritzie was a clothes person. My mother says that when she got a new dress, Fritzie was always the first person to wear it! Just like your Fritzie! The sisters always played cards and yelled at each other,with love, all the time. So your family story struck a cord with me and reminded me of my family memories.I am the grandma now, and although families today are smaller and often far apart in miles, I hope the traditions that I maintain at Passover will continue.",
    "nam": "Marilyn Gotkin",
    "loc": " Long Island, New York ",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "I'm Still Crying",
    "mes": "I can&#039;t thank you enough for the gift of your show.  Thank God someone had the sense and foresight to film these wonderful women from &quot;the other side,&quot; remaining members of a generation that, before long, will no longer be with us.  And, all the photos of the tantes, zaides, and bubbies!  You completely captured the richness of deep, loving  family connections and traditions.  More than anything I&#039;ve experienced in my adult life, the Gefilte Fish Chronicles put me back in touch with my Jewish roots in a way I can&#039;t even describe.  It&#039;s the next day, and I&#039;m still crying.",
    "nam": "Naomi Drew",
    "loc": " Lambertville, NJ",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "I laugh, I laugh, I chuckled, I cried",
    "mes": "What a privilege it was to walk down a matzah strewn (k&#039;naydle-strewn? you shouldn&#039;t know from such things!) memory lane...though our observances are somewhat different, the chance to see the matriachs&quot;in action&quot;, the aged-old wisdom spouting during the laborious and uproariously funny preparations were bested only by the heartfelt message of family togetherness above all else. Thank you for showing us your family which in turn has allowed us to re-cherish ours!",
    "nam": "Jeffrey D Smith",
    "loc": " New York",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "What It's All About.........",
    "mes": "A joyous, laugh out loud, and, yes, tears at the end after viewing this glorious celebration of family.  I cannot think of a more wonderful tribute to the people you love.",
    "nam": "Alice",
    "loc": " New Providence, NJ",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "A MITZVAH!",
    "mes": "I couldnt see a lot of the show...I was in tears! Nothing but memories",
    "nam": "Chuck",
    "loc": " Commack, NY",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "What Memories !!!!!!",
    "mes": "I only got to see the last 15 minutes. Can you tell me when the show will air again in the New york City area? Our family was very small but I do remember the Seders and the amount of food we were able to consume. I now have the food grinder that my mom used to make her gefilte fish.\nrcurlytop-AT-optonline-DOT-net",
    "nam": "Ruth",
    "loc": " Tappan, NY",
    "email": "/>rcurlytop@optonline.net",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Meat grinder memories in Canada",
    "mes": "Just finished watching the movie on the DVR. Thank goodness for taping.  The story of the meat grinder was hilarious and of course I remember my Mother using one and then making horseradish in the backyard in Chatham Ontario.   Jews look the same no matter where they live or what they look like.  Thanks for the memories and fun.",
    "nam": "Carol Krim",
    "loc": " Stamford, Ct",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Thank You!",
    "mes": "Thank you for preserving our memories.  Sadly, the traditions are fading away as we lose the generations of our parents and grandparents.  How wonderful it was to hear the voices and see the expressions.  It brought me back to a different time. I was so moved that I want to share my feelings with my grown sons so that they will understand their heritage better. I will be able to by giving them your DVD and Cookbook.  Thank you again.",
    "nam": "Judy",
    "loc": " Connecticut",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Adopt Me...please!",
    "mes": "Your wonderful show brought me to tears. Seeing all the love and togetherness made me miss my Mom, sister and brother who are gone now, but with me in spirit always.  Who would have thought that watching sisters cook, kibbitz, argue and put together a meat grinder no less!! could be so entertaining.  God Bless you for making this for all of us to share.  I&#039;m Irish through and through, but I&#039;m getting that cookbook!  I have to make that cholent!",
    "nam": "Joan",
    "loc": " Middletown, NY",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "my husband cried",
    "mes": "My husband and I just watched this remarkable movie on televison on and he cried! Both our mothers are gone and Passover is all about family - especailly mothers! We wish we had that many people to invite to our home for Sedar.",
    "nam": "Judy Cohen",
    "loc": " Staten Island, NY",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Reminds me of my family",
    "mes": "I just caught the tail end of this on channel 13 here in NYC. The phrase &quot;the cousins&quot;, from my parents&#039; generation, was also a phrase I heard while growing up and into my early 30s. I too never thought it strange I know some of my second and third cousins, visiting (or, in this age, emailing) them on a somewhat regular basis. Our seders were rocking, but we never had more then 30 people (excluding the few of my grandparents&#039; generation that were larger, but those ended sometime in the early 70s &amp; I barely remember them). \n\nWith my parents&#039; generation retiring or passing away, the larger seders are a thing of the past (though my wife and I got about 25 people from both sides of our families into our house a few years ago). However, sone traditions remain. One of my mother&#039;s first cousins moved down to DC decades ago, so we only saw them once a year, either at Passover or during summer. Sure enough, last summer, as tradition dictates, my family and I went down to visit my second cousins and our children, third cousins, had a wonderful time. We may not see each other as often as we like, but we&#039;re in each others&#039; lives.",
    "nam": "Mike",
    "loc": " Manalapan, NJ",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "I LAUGHED AND CRIED AT THE SAME TIME",
    "mes": "The most beautiful, menschlich, humorous, goosebumping, somewhat salty from my tears, gorgeous documentary, THAT EVERYONE CAN AND SHOULD LEARN FROM, how to go trough life -- it brought vivid memories from my own family, my dearest Grandma Persida, (Bless Her Beautiful Soul) and my youth in Yougoslavia... THANK YOU, YOU THREE SCHOENE MAEDLE, THANK YOU VERY MUCH !\nYours, Vladimir K. :)",
    "nam": "Vladimir",
    "loc": " New York City",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Thank you for making me part of your family!",
    "mes": "I am alone this Pesach.  I was feeling sorry for myself, but after watching the show, I feel full and exhausted, just as if I was there.  I still miss the old timers cooking and kibbitzing, but the show was the next best thing to being there.  And now, I&#039;m feeling a little peckish!  I&#039;ll order the book and dvd.  Again, thank you.\n-Lev",
    "nam": "Lev",
    "loc": " Brooklyn!!!!!",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "South Florida",
    "mes": "I was born in Newburgh and lived there my whole like until three years ago.  Of course I know all the Newburg Dubroffs.  My mom and Peppy were good friends.  Unfortunately our local PBS station doesn&#039;t seem to be showing &quot;The Gefilte Fish Chronicles.&quot;  I hope they&#039;ll change their mind.",
    "nam": "Beverly (Buz) Neumetzger",
    "loc": " Boca Raton, FL",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "The Wilde's",
    "mes": "Can&#039;t wait to watch this and catch a glimpse of those Wildes. I have known the family forever and if there is one thing Marty has taught them,it is the importance of family.I never knew Honey&#039;s family was so extended and connected. Thank you all for sharing yourselves...",
    "nam": "Richard Burgi",
    "loc": " Hollywood ,Ca.",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "G.F.C. reviewed in Saturday's New York Times",
    "mes": "Check out page B-13 in the Saturday (March 31) New York Times for Ron Wertheimer&#039;s review of the Gefilte Fish Chronicles (to be seen Sunday, April 1, on WNET, Ch. 13) in metro New York",
    "nam": "David B.",
    "loc": " Gefilte Fish Central",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Local viewing in Washing ton DC area",
    "mes": "Hi, \nI live in the Metro Washington DC area. I was wondering if this was going to be aired on any other PBS networks? Please let me know:dborris-AT-hotmail-DOT-com",
    "nam": "Debbie Borris",
    "loc": " Northern Viginia",
    "email": "know:dborris@hotmail.com",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "GEFILTE FISH CHRONICLES ON TV THIS SUNDAY !!!!!",
    "mes": "For those in the New York area this Sunday, don&#039;t miss the television broadcast premiere of The Gefiltefish Chronicles !!\n\nSunday, April 1st at 7:00 pm on PBS Channel 13",
    "nam": "Cousins Allegra + Jimmy",
    "loc": " NY",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "need for resale -dvd",
    "mes": "hello- I would like to resale the dvd. How much? thx sal",
    "nam": "simcha sales inc.",
    "loc": " 11 imbrook lane aberdeen , n.j. 07747",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Greetings from a Bradford Streeet Octagenarian",
    "mes": "I&quot;m absolutly thrilled - I opened the Jewish Forward (in english) which we subscribe to and I saw the name Dubroff .  Where else is there a Dubroff if not Dumont Ave.   I would love to talk to you and reminisce  so if you have the time, please e-mail me your phone number.  Ray and I are well, living in a condominium called Clearbrook in Monroe Township,NJ",
    "nam": "Secky Tave Feder",
    "loc": " rlfsara-AT-verizon-DOT-net",
    "email": "rlfsara@verizon.net",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "The true meaning of family",
    "mes": "I have been a friend of Iris&#039; for more than 40 years and have heard the stories of her family and Passover. I have had the pleasure of meeting her Mom Rosie &amp; Aunt Peppy. Remarkable women. This CD is a tribute to traditions, family and most of all, LOVE.  Don&#039;t miss it.  Buy it and watch with your family.  It&#039;s wonderful.",
    "nam": "Karen",
    "loc": " Morristown, New Jersey",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "OY",
    "mes": "The subtle and not so subtle comments, manerisms and body language of the video bring back many wonderful memories.  I did not stop smiling once.",
    "nam": "Scott Goldsmith",
    "loc": " Pittsburgh PA",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "WONDERFUL!!",
    "mes": "What a very special and beautiful idea this is.  I&#039;ve been a friend of Sheila&#039;s for many years and she told me about this.  I always remember her talking so lovingly about her family.  And, I&#039;ve heard many funny stories!  I had the pleasure of meeting her parents.  Wonderful people. I remember them well.  Not sure Iris will remember, but I met her when I was living in Boston.  Sorry that I&#039;ve never met Sheila&#039;s &quot;famous&quot; aunts. They all look just as beautiful, and happy as I suspected.  \n\nThis brings back fond memories of holidays I&#039;ve spent with my family.  It was a very special time, which I fondly remembered watching this.\n\nYou did a fabulous job putting this all together.  \nMy very best to the Dubroff family.",
    "nam": "Beverly Sbarge",
    "loc": " Southern California",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "NEXT YEAR IN HOLLYWOOD",
    "mes": "Congratulations on preserving all the main ingredients !\n                                      Linda( Kaufman) Ippolito",
    "nam": "LINDA KAUFMAN IPPOLITO",
    "loc": " MONTCLAIR,N.J",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "AND THE WINNER IS............",
    "mes": "Anyone who knows the Dubroff family will attest to loving them.  But, as Helene would say &quot;What&#039;s there not to love?&quot;.  Sheil... I was never the same after my weekend in Newburg and the Passover Seder with you.  I left with many wonderful memories, hugs, laughter, love from the aunts, and like everyone else, sponge cake! From someone (Italian)who knows a loving family when they see one.  Mozeltov! to the Directors, Producers, Actors, Supporting Actors and the Key Grip.  I absolutely LOVE &quot;the Chronicles&quot; and can&#039;t wait to share it with my friends out here on the west coast.",
    "nam": "Anita Nasuto",
    "loc": " Carmel Valley, Ca.  ",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "See The Chronicles at the Bainbridge Film Fest",
    "mes": "The Gefilte Fish Chronicles will be featured March 11th, at 3:40pm at the Bainbridge Island Film Festival (near Seattle) If you are in the neighborhood come on by.  More info at www.artshum.org",
    "nam": "David B",
    "loc": " Washington DC",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "wish a were a jew!",
    "mes": "seems that people wish they were italian - this makes you wish you were jewish!!!!!",
    "nam": "lisa corrado",
    "loc": " hingham",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Love of Family",
    "mes": "Saw the movie in Denver with my wife and brother. Loved the way you portrayed the meaning of family. I urge everyone to buy the video and enjoy a laugh and shed a few tears. Thank you for carrying on one of our people&#039;s great traditions.",
    "nam": "Ben Levinson",
    "loc": " Denver",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Matzah Ball",
    "mes": "Who is that adorable young girl in the blue that is talking about matzah balls in the movie clip? Why does she love matzah balls so much?",
    "nam": "Sherm",
    "loc": " New Jersey",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "Paul Kirson",
    "mes": "In your film, you named and showed a picture of Paul Kirson. Mr. Kirson lived two houses away from me while I was growing up in Brooklyn. I have been trying to find his son Hiram Kirson, but have been unable to locate him. Paul&#039;s daughter married a dentist and moved to Havastraw, NY. Do you know the whereabouts of Hiram Kirson? My email is: gr8lassow-AT-comcast-DOT-net",
    "nam": "Gerald Lassow",
    "loc": " Denver, CO",
    "email": "gr8lassow@comcast.net",
    "stamp": "2012-04-02 04:45:33"
  },
  {
    "tit": "",
    "mes": "",
    "nam": "",
    "loc": "",
    "email": "",
    "stamp": "2012-04-02 04:45:33"
  }
]